app/Controllers/Home.php

SELECT *
FROM `paiement`
RIGHT JOIN `etudiant` ON `etudiant`.`NumMat` = `paiement`.`NumMat`
ORDER BY `DateP` DESC
---
    public function index(): string
    {
        $query  = Database::connect();
        $paiements = $query->table('paiement')
                        ->select('*')
                        ->join('etudiant', 'etudiant.NumMat = paiement.NumMat', 'right')
                        ->orderBy('DateP', 'DESC')
                        ->get()
                        ->getResultArray();

SELECT *
FROM `paiement`
RIGHT JOIN `etudiant` ON `etudiant`.`NumMat` = `paiement`.`NumMat`
WHERE `paiement`.`NumMat` LIKE '%Frais de Scolarité%' ESCAPE '!'
OR  `paiement`.`DateP` LIKE '%Frais de Scolarité%' ESCAPE '!'
OR  `etudiant`.`NomEtudiant` LIKE '%Frais de Scolarité%' ESCAPE '!'
OR  `paiement`.`Motif` LIKE '%Frais de Scolarité%' ESCAPE '!'
---
    public function search()
    {
        $q = $this->request->getPost('query');
        $query  = Database::connect();

        $paiements = $query->table('paiement')
                        ->select('*')
                        ->join('etudiant', 'etudiant.NumMat = paiement.NumMat', 'right');

        if(isset($q)) {
            $result = $paiements->like('paiement.NumMat', $q)
                ->orLike('paiement.DateP', $q)
                ->orLike('etudiant.NomEtudiant', $q)
                ->orLike('paiement.Motif', $q);
            $resultats = $result->get()->getResultArray();