app/Controllers/Home.php

    public function index(): string
    {
        $etudiants = (new EtudiantModel())->findAll();
---
SELECT *
FROM `Etudiant`