app/Controllers/PaiementController.php

SELECT *
FROM `paiement`
RIGHT JOIN `etudiant` ON `etudiant`.`NumMat` = `paiement`.`NumMat`
ORDER BY `DateP` DESC
SELECT *
FROM `Etudiant`
---
    public function index()
    {
        helper('form');
        $query  = Database::connect();
        $students = $query->table('paiement')
                        ->select('*')
                        ->join('etudiant', 'etudiant.NumMat = paiement.NumMat', 'right')
                        ->orderBy('DateP', 'DESC')
                        ->get()
                        ->getResultArray();

        $etudiants = (new EtudiantModel())->findAll();

SELECT *
FROM `paiement`
RIGHT JOIN `etudiant` ON `etudiant`.`NumMat` = `paiement`.`NumMat`
ORDER BY `DateP` DESC
SELECT *
FROM `Etudiant`
INSERT INTO `Paiement` (`NumMat`, `Montant`, `Motif`, `DateP`) VALUES ('17', '2250', 'scolarite', '2024-04-12')
---
    public function enregistrer()
    {
        helper('form');

        $data = $this->request->getPost(['NumMat', 'Montant', 'Motif', 'DateP']);

        if (! $this->validateData($data, [
            'NumMat' => 'required',
            'Montant'  => 'required',
            'Motif'  => 'required',
            'DateP'  => 'required',
        ])) {
            $query  = Database::connect();
            $students = $query->table('paiement')
                        ->select('*')
                        ->join('etudiant', 'etudiant.NumMat = paiement.NumMat', 'right')
                        ->orderBy('DateP', 'DESC')
                        ->get()
                        ->getResultArray();
            $etudiants = (new EtudiantModel())->findAll();

        return view('paiement/paiement', compact('students', 'etudiants'));
        }

        $post = $this->validator->getValidated();

        $model = model(PaiementModel::class);

        $model->save([
            'NumMat' => $post['NumMat'],
            'Montant'  => $post['Montant'],
            'Motif'  => $post['Motif'],
            'DateP'  => $post['DateP'],
        ]);

SELECT *
FROM `Etudiant`
---
    public function editer(int $payer)
    {
        helper('form');
        $paiement = (new PaiementModel)->where('NumMat', $payer)->first();
        $etudiants = (new EtudiantModel())->findAll();