app/Controllers/PaiementController.php

    public function enregistrer()
    {
        helper('form');

        $data = $this->request->getPost(['NumMat', 'Montant', 'Motif', 'DateP']);

        if (! $this->validateData($data, [
            'NumMat' => 'required',
            'Montant'  => 'required',
            'Motif'  => 'required',
            'DateP'  => 'required',
        ])) {
            $paiements = (new PaiementModel())->findAll();
            $etudiants = (new EtudiantModel())->findAll();

        return view('paiement/paiement', compact('paiements', 'etudiants'));
        }

        $post = $this->validator->getValidated();

        $model = model(PaiementModel::class);

        $model->save([
            'NumMat' => trim($post['NumMat']),
            'Montant'  => trim($post['Montant']),
            'Motif'  => trim($post['Motif']),
            'DateP'  => trim($post['DateP']),
        ]);
---
INSERT INTO `Paiement` (`NumMat`, `Montant`, `Motif`, `DateP`) VALUES ('Choisir un étudiant', '5000', 'Minerval', '2024-04-10')